In [1]:
import pandas as pd

In [2]:
stock_data = pd.read_csv("./data/stock_day.csv")

In [4]:
stock_data.head()

,open,high,close,low,volume,price_change,p_change,ma5,ma10,ma20,v_ma5,v_ma10,v_ma20,turnover
2018-02-27,23.53,25.88,24.16,23.53,95578.03,0.63,2.68,22.942,22.142,22.875,53782.64,46738.65,55576.11,2.39
2018-02-26,22.80,23.78,23.53,22.80,60985.11,0.69,3.02,22.406,21.955,22.942,40827.52,42736.34,56007.50,1.53
2018-02-23,22.88,23.37,22.82,22.71,52914.01,0.54,2.42,21.938,21.929,23.022,35119.58,41871.97,56372.85,1.32
2018-02-22,22.25,22.76,22.28,22.02,36105.01,0.36,1.64,21.446,21.909,23.137,35397.58,39904.78,60149.60,0.90
2018-02-14,21.49,21.99,21.92,21.48,23331.04,0.44,2.05,21.366,21.923,23.253,33590.21,42935.74,61716.11,0.58

In [7]:
stock_data = stock_data.drop(["ma5","ma10","ma20","v_ma5","v_ma10","v_ma20"], axis=1)

In [8]:
stock_data.head()

,open,high,close,low,volume,price_change,p_change,turnover
2018-02-27,23.53,25.88,24.16,23.53,95578.03,0.63,2.68,2.39
2018-02-26,22.80,23.78,23.53,22.80,60985.11,0.69,3.02,1.53
2018-02-23,22.88,23.37,22.82,22.71,52914.01,0.54,2.42,1.32
2018-02-22,22.25,22.76,22.28,22.02,36105.01,0.36,1.64,0.90
2018-02-14,21.49,21.99,21.92,21.48,23331.04,0.44,2.05,0.58

# pandas索引

In [10]:
stock_data["open"]["2018-02-27"]

23.53

In [13]:
# stock_data["2018-02-27"]["open"]  # 不可以先行后列
# stock_data[:1, :2]

In [14]:
stock_data.loc["2018-02:-27":"2018-02-23", "high"]

2018-02-27    25.88
2018-02-26    23.78
2018-02-23    23.37
Name: high, dtype: float64

In [15]:
stock_data.iloc[:3, :5]

             open   high  close    low    volume
2018-02-27  23.53  25.88  24.16  23.53  95578.03
2018-02-26  22.80  23.78  23.53  22.80  60985.11
2018-02-23  22.88  23.37  22.82  22.71  52914.01

In [18]:
stock_data.ix[:5, ("high", "low")]

/Users/sherwin/workspaces/ai/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

             high    low
2018-02-27  25.88  23.53
2018-02-26  23.78  22.80
2018-02-23  23.37  22.71
2018-02-22  22.76  22.02
2018-02-14  21.99  21.48

In [21]:
stock_data.columns.get_indexer(["open", "low"])

array([0, 3])

In [22]:
stock_data.index

Index(['2018-02-27', '2018-02-26', '2018-02-23', '2018-02-22', '2018-02-14',
       '2018-02-13', '2018-02-12', '2018-02-09', '2018-02-08', '2018-02-07',
       ...
       '2015-03-13', '2015-03-12', '2015-03-11', '2015-03-10', '2015-03-09',
       '2015-03-06', '2015-03-05', '2015-03-04', '2015-03-03', '2015-03-02'],
      dtype='object', length=643)

# 赋值操作

In [23]:
stock_data["volume"] = 100

In [25]:
stock_data.volume = 1000

In [26]:
stock_data.head()

,open,high,close,low,volume,price_change,p_change,turnover
2018-02-27,23.53,25.88,24.16,23.53,1000,0.63,2.68,2.39
2018-02-26,22.80,23.78,23.53,22.80,1000,0.69,3.02,1.53
2018-02-23,22.88,23.37,22.82,22.71,1000,0.54,2.42,1.32
2018-02-22,22.25,22.76,22.28,22.02,1000,0.36,1.64,0.90
2018-02-14,21.49,21.99,21.92,21.48,1000,0.44,2.05,0.58

# 排序

## dataframe

In [28]:
stock_data.sort_values(by="open", ascending=True).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,1000,0.32,2.62,3.30
2015-09-02,12.30,14.11,12.36,12.30,1000,-1.10,-8.17,2.40
2015-03-03,12.52,13.06,12.70,12.52,1000,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,1000,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,1000,0.26,2.02,3.19

In [30]:
stock_data.sort_values(by=["open", "high"]).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,1000,0.32,2.62,3.30
2015-09-02,12.30,14.11,12.36,12.30,1000,-1.10,-8.17,2.40
2015-03-03,12.52,13.06,12.70,12.52,1000,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,1000,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,1000,0.26,2.02,3.19

In [32]:
stock_data.sort_index().head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,1000,0.32,2.62,3.30
2015-03-03,12.52,13.06,12.70,12.52,1000,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,1000,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,1000,0.26,2.02,3.19
2015-03-06,13.17,14.48,14.28,13.13,1000,1.12,8.51,6.16

## series

In [39]:
stock_data["open"].sort_values(ascending=False).head()

2015-06-15    34.99
2015-06-12    34.69
2015-06-10    34.10
2017-11-01    33.85
2015-06-11    33.17
Name: open, dtype: float64

In [41]:
stock_data["open"].sort_index().head()

2015-03-02    12.25
2015-03-03    12.52
2015-03-04    12.80
2015-03-05    12.88
2015-03-06    13.17
Name: open, dtype: float64